Revit 2021.1 API
ImageType.IsViewImage Property
 The ImageType was created via "Save to Project as Image" function. For such ImageTypes the file path is an empty string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2020
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2021 and will be removed in the next version of Revit. We suggest you use instead the Source property.")]
public bool IsViewImage { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2021 and will be removed in the next version of Revit. We suggest you use instead the Source property.")> _
Public ReadOnly Property IsViewImage As Boolean
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2021 and will be removed in the next version of Revit. We suggest you use instead the Source property.")]
public:
property bool IsViewImage {
	bool get ();
}
See Also
ImageType Class
Autodesk.Revit.DB Namespace